Tekla Open API Reference for Tekla Structures 2025
Bolt.BoltAttributes Class
 The BoltAttributes class is the attributes class for the bolt.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.AttributesBase
 Tekla.Structures.Drawing.Bolt.BoltAttributes
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class BoltAttributes : AttributesBase
<SerializableAttribute>
Public NotInheritable Class BoltAttributes
	Inherits AttributesBase
The Bolt.BoltAttributes type exposes the following members.
Constructors
Name | Description
Bolt.BoltAttributes()
 Creates a new default bolt attributes instance that loads standard attributes.
Bolt.BoltAttributes(String)
 Creates a new bolt attributes instance that loads the specified attributes.
Top
Properties
Name | Description
Color
 The color of the bolt.
CustomPresentation
 Custom presentation GUID to be applied to the bolt
Representation
 The representation type of the bolt.
SymbolContainsAxis
 True if the bolt symbol contains an axis.
SymbolContainsHole
 True if the bolt symbol contains a hole.
TrueColor
 The true color (RGB enabled) of the bolt.
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides AttributesBase.IsEqual(Object).)
LoadAttributes
 Loads the attributes from the attribute file.
 (Overrides AttributesBase.LoadAttributes(String).)
Top
See Also
Reference
Tekla.Structures.Drawing Namespace